new csw to me 
PROTENSE#
ASSIEGE#
ROSINATE#
CRIMED#
NOWED#
UNOWED#
PIERISES#/PIERIS#
the stupid anagrams to TASERED#
GRISLIES/GREISLY/GRIESLY/GRYSELY
KHANDA#
PRESSIE#
EPRISE#/ESPIER#
ASPINE#/SPINAE#
YETTIE#
STIRE#
EFFERENCE#
PINDARI#/PRIDIAN#
PINBOARD#
TWIRE#
ORVAL#
EMBOILS#
CALIVER#/VELARIC#
PIANINO#
STOOPE#
APOSITIC#
BASTI#/BUSTI#/BUSTEE#
UNFABLED#/FUNDABLE#
UNFEUDAL#
NOTITIAS#
KANTENS#
VALLAR#/VALLARY#
HAOMA#
BETID#
LENTI#
OXHIDE#
GEGGIE#
TAWIEST/TWAITES#
SHULE#
TIGERY#
PITPROP#
CESTUI#/CUEIST#
AFARA#
BENGA#
BEFANA#/BEFFANA#
BENET#
NAUNT#
THEIC#
WRATE#
BRINNY#/YONNIE#
VACUATE#
STIVE#
DISANNEX#
NICHERS#
ATABEGS#/ATABEKS#/TEABAGS#
MEDLE#/MEDLING#
COTTID#/COTTUS#
CRIOS#/SIROC#
COREGENT#
WHOOT#
PUISNY#
ELSIN#/ELSHIN#
TODDE#
ONELY#
GIDJEE#/GIDGEE#
BUFTY#/BUFTIE#
STIEVE#/STIEVER#/STIEVEST#
BINIOU#
CITAL#/ICTAL#
KOURA#
PERFET#
ORANT#/ROTAN#/TORAN#
PELMATIC#
POEMATIC#
PUMICATE#

challenges
me
successful
DZOBO*
SEIKIES*
ONIES*
UNMARK*

unsuccessful
CRIMED#
STIRE#
KILEY#
EMBOILS#/SCARIOUS
BANZAIS
SNOOZER
WRATE#
BRINNY#
FEINTEST#
SQUIRTER
WHOOT#
STREWAGE#

them
successful
DOATE*
PINDARS*
SCORIAS*
FAUVEST*
DOTEL*


unsuccessful
CRYONIC
VELOUTE
WENNY
GER#
KORATS
PYXING#
PERN#
NALA
CORGIS
DEGLAZE
SLEDDER
FLURRS#
DAGOBA
ENES
MASCON
LOAVED#
ISLETED
TYRAN#
STOOZED#

unchallenged phonies
me
EXCURSOR*
VERBY*

them
DOVEY* (Nakil, Rd 11)
GYROID* (Olaugh, Rd 29)

BINGOS

Day 1

Mine 15 (5 CSW)
POTTEENS
ARSONITE#
ENTRAIL#
OUTFITS
SOLVENT
PLENISH
GRIDDER
UNPRAISE#
CREMANT#
SECONAL
SINTERS
VELOUTE
PONIARDS
RIDDERS
ARVICOLE#

Theirs  14 (3 CSW)
UNSTRING
SIGNEES
ORDINAL
LENDERS
RODINGS#
SERVING
BOOZING
COATEES
TASERED#
STANNEL
PRONATE
INTENSE
UNTAMED
EMBOILS#


BINGOS DAY 2
mine 22 (0 CSW)
FENTANYL
ORIENTAL
ONANISMS
TONEARM
CASTING
CODGERS
RETINUE
INDULTS
FLAUNTED
HABITANS
GOONIEST
DEGLAZE
SLEDDER
OSTINATI
WOODIES
ELKHOUND
TRINITY
ENTICED
EQUATOR
EXAMINE
STANZAED
CRESTAL

them 11 (2 CSW)
RAISERS
SOOTIER
EXTRAITS#
AUDITING
SNOOZER
TEATIME
SEIZING
UTILIDOR
KENTIAS#
DISTEND
ROASTING

BINGOS DAY 3
mine 13 (1 CSW)
ENCLAVED
INERRANT
DITTANY
PRATTLED
MEOUING
BRIGADE
WEANLING
RAREFIED
HERETIC
AGRISES#
RESCIND
PROCAINE
ISLETED

theirs 17 (7 CSW)
EPHEDRIN
OSMIATE#
RIBSTON#
RETIRANT
SEEABLE
ISOETES#
ORARIAN#
SUETIER#
EROTIZE
FOISTED
GATHERS
FLOKATI
SUETIER#
FEINTEST#
KEITLOA
PINDERS
NEUROID

BINGOS DAY 4

Mine 15 (3 CSW)
RICHENS
BANGSTER#
CARRIERS
DELUSTER
ADAPTED
BUTANOIC#
VERIFIED
TANNABLE
NEUSTIC
RETIREES
NOONDAY
PHENOXY
NOTAIRE#
TONSILAR
COGNIZER

Them 12 (4 CSW)
SQUIRTER
MELDING
STRONGER
INCENTRE#
RIDDLERS
ISOGONE
STREWAGE#
ARAISES#
EROTISE#
ELAPINE
ASUNDER
FIDEIST

MISSED BINGOS
APOSITIC# (rd 10)
SNEESHAN# (rd 15)
BURNSIDE# (rd 22)
COTTIDS# (rd 25)
TUBEROID (rd 28)
LAPTRAY# (rd 28)
PELMATIC#/PUMICATE#/POEMATIC# (rd 31))
7 total

65 bingos (9 CSW) to 54 (16 CSW)
2.1 to 1.74
found 9/15 collins bingos

blanks
2 xxxxxxxxx		9
1 xxxxxxxxxxxxxxxxx	17
0 xxxxx			5

35 blanks

phonies: 25+29

0
0
18
8
25
56
4
3
10
33
40
0
0
0
16
0
0
0
5
0
10
30
10
0
60
7
30
57
5
10
83
/520